In [1]:
import pandas as pd
import numpy as np

In [2]:
dict1={
    "name":['omkar','sairaj','rohan'],
    "marks":[23,25,25],
    "city":['rampur',"nagpur","jamshedpur"]
}  
#rows must be of same size

# dictionary to dataframe

In [3]:
df=pd.DataFrame(dict1)  #converting to data frame
df

     name  marks        city
0   omkar     23      rampur
1  sairaj     25      nagpur
2   rohan     25  jamshedpur

# exporting to csv

In [4]:
df.to_csv('info.csv')

In [5]:
df.to_csv('info_without_indexing.csv',index=False)  #eithout indexing

In [6]:
df.head(2)  #first two rows

     name  marks    city
0   omkar     23  rampur
1  sairaj     25  nagpur

In [7]:
df.tail(2)  #last two rows

     name  marks        city
1  sairaj     25      nagpur
2   rohan     25  jamshedpur

In [8]:
df.describe()  #information

           marks
count   3.000000
mean   24.333333
std     1.154701
min    23.000000
25%    24.000000
50%    25.000000
75%    25.000000
max    25.000000

# reading csv file

In [9]:
df=pd.read_csv('nba.csv')  #reading csv file

In [10]:
df

,Name,Team,Number,Position,Age,Height,Weight,College,Salary
0,Avery Bradley,Boston Celtics,0.0,PG,25.0,6-2,180.0,Texas,7730337.0
1,Jae Crowder,Boston Celtics,99.0,SF,25.0,6-6,235.0,Marquette,6796117.0
2,John Holland,Boston Celtics,30.0,SG,27.0,6-5,205.0,Boston University,NaN
3,R.J. Hunter,Boston Celtics,28.0,SG,22.0,6-5,185.0,Georgia State,1148640.0
4,Jonas Jerebko,Boston Celtics,8.0,PF,29.0,6-10,231.0,NaN,5000000.0
...,...,...,...,...,...,...,...,...,...
453,Shelvin Mack,Utah Jazz,8.0,PG,26.0,6-3,203.0,Butler,2433333.0
454,Raul Neto,Utah Jazz,25.0,PG,24.0,6-1,179.0,NaN,900000.0
455,Tibor Pleiss,Utah Jazz,21.0,C,26.0,7-3,256.0,NaN,2900000.0
456,Jeff Withey,Utah Jazz,24.0,C,26.0,7-0,231.0,Kansas,947276.0
457,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [11]:
df['Name']  #accessing coulumns

0      Avery Bradley
1        Jae Crowder
2       John Holland
3        R.J. Hunter
4      Jonas Jerebko
           ...
453     Shelvin Mack
454        Raul Neto
455     Tibor Pleiss
456      Jeff Withey
457              NaN
Name: Name, Length: 458, dtype: object

In [12]:
df['Name'][1]  #accessing fields

'Jae Crowder'

In [13]:
df['Name'][1]="omkar" #changing data values(fields)

C:\Users\omkar\AppData\Local\Temp\ipykernel_18132\783329745.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df['Name'][1]="omkar" #changing data values(fields)

In [14]:
#custome indexing
df=pd.DataFrame(dict1)
#rows
df.index=['first','second','third']  #for all rows
#cols
#changing col names(for single or multiple cols)
df.rename(columns={'marks':'full_marks','city':'current city'},inplace=True)
#renaming all cols
df.columns=['_x','_y','z*_']
df.columns.values[0]='b'  #changing cols name using 0 1 indexing
df.columns.values[0]='c'
#replacing specific char 
df.columns=df.columns.str.replace('_','&&&') #replacing _ with &&& for every col
df.columns=df.columns.str.replace('&&&','') 
df

             c   y          z*
first    omkar  23      rampur
second  sairaj  25      nagpur
third    rohan  25  jamshedpur


# series and dataframe

In [15]:
x = pd.Series(np.random.rand(32))

In [16]:
x

0     0.663550
1     0.874964
2     0.644883
3     0.509114
4     0.541873
5     0.863953
6     0.511576
7     0.781358
8     0.097472
9     0.426355
10    0.248511
11    0.431767
12    0.273291
13    0.213361
14    0.973932
15    0.975771
16    0.555749
17    0.166218
18    0.111187
19    0.476134
20    0.030748
21    0.558554
22    0.778263
23    0.755983
24    0.788543
25    0.695946
26    0.637055
27    0.146934
28    0.656008
29    0.652139
30    0.454255
31    0.315550
dtype: float64

In [17]:
type(x)

pandas.core.series.Series

In [20]:
newdf=pd.DataFrame(np.random.rand(10,5),index=np.arange(10), columns=["11", "22", "33", "44", "55"])
newdf

         11        22        33        44        55
0  0.232684  0.139040  0.077496  0.223601  0.773927
1  0.022073  0.828988  0.050751  0.383278  0.164082
2  0.964124  0.147582  0.561191  0.628581  0.547900
3  0.298839  0.203547  0.093747  0.162059  0.404882
4  0.671587  0.775182  0.865590  0.921330  0.983814
5  0.168139  0.534345  0.743579  0.590970  0.544572
6  0.319197  0.339152  0.427981  0.309263  0.756847
7  0.924485  0.144940  0.141633  0.460922  0.924361
8  0.742565  0.103737  0.162666  0.275482  0.054196
9  0.730113  0.223851  0.494910  0.884617  0.101130

In [21]:
type(newdf)

pandas.core.frame.DataFrame

In [22]:
newdf[0][0]=["omkar","sairaj"]
newdf[0][0][1]
newdf.dtypes
newdf.to_csv('new.csv')
newdf[0][0][1]
newdf

KeyError: 0

In [ ]:
newdf.index

Int64Index([0, 1, 2, 3, 4, 5, 6, 7, 8, 9], dtype='int64')

In [ ]:
newdf.columns
newdf.columns=['a','b','c','d','e']
newdf

                 a         b         c         d         e
0  [omkar, sairaj]  0.871735  0.070232  0.093145  0.125359
1         0.182761  0.197845  0.749684  0.722638  0.792393
2         0.307461  0.905553  0.006770  0.415487  0.441121
3         0.069815  0.793227  0.545553  0.938383  0.201275
4         0.703251  0.429368  0.825447  0.268012  0.269413
5         0.869188  0.256182  0.608883  0.115711  0.051274
6         0.416681  0.176843  0.769127  0.520808  0.051635
7         0.683456  0.722375  0.523965  0.346303  0.186340
8         0.218887  0.175965  0.987823  0.578938  0.272895
9         0.524484  0.985938  0.411249  0.572005  0.092691

# to_numpy

In [32]:
print(newdf.to_numpy().ndim)
print(newdf.to_numpy)

2
<bound method DataFrame.to_numpy of          11        22        33        44        55
0  0.232684  0.139040  0.077496  0.223601  0.773927
1  0.022073  0.828988  0.050751  0.383278  0.164082
2  0.964124  0.147582  0.561191  0.628581  0.547900
3  0.298839  0.203547  0.093747  0.162059  0.404882
4  0.671587  0.775182  0.865590  0.921330  0.983814
5  0.168139  0.534345  0.743579  0.590970  0.544572
6  0.319197  0.339152  0.427981  0.309263  0.756847
7  0.924485  0.144940  0.141633  0.460922  0.924361
8  0.742565  0.103737  0.162666  0.275482  0.054196
9  0.730113  0.223851  0.494910  0.884617  0.101130>

In [33]:
#transpose of dataframe
newdf.T

,0,1,2,3,4,5,6,7,8,9
11,0.232684,0.022073,0.964124,0.298839,0.671587,0.168139,0.319197,0.924485,0.742565,0.730113
22,0.139040,0.828988,0.147582,0.203547,0.775182,0.534345,0.339152,0.144940,0.103737,0.223851
33,0.077496,0.050751,0.561191,0.093747,0.865590,0.743579,0.427981,0.141633,0.162666,0.494910
44,0.223601,0.383278,0.628581,0.162059,0.921330,0.590970,0.309263,0.460922,0.275482,0.884617
55,0.773927,0.164082,0.547900,0.404882,0.983814,0.544572,0.756847,0.924361,0.054196,0.101130

In [34]:
#sorting
newdf.sort_index(axis=0,ascending=False) #(by default asc true and axis 0(row))
# newdf.sort_index(axis=0)  0 for row and 1 for col

         11        22        33        44        55
9  0.730113  0.223851  0.494910  0.884617  0.101130
8  0.742565  0.103737  0.162666  0.275482  0.054196
7  0.924485  0.144940  0.141633  0.460922  0.924361
6  0.319197  0.339152  0.427981  0.309263  0.756847
5  0.168139  0.534345  0.743579  0.590970  0.544572
4  0.671587  0.775182  0.865590  0.921330  0.983814
3  0.298839  0.203547  0.093747  0.162059  0.404882
2  0.964124  0.147582  0.561191  0.628581  0.547900
1  0.022073  0.828988  0.050751  0.383278  0.164082
0  0.232684  0.139040  0.077496  0.223601  0.773927

In [35]:
type(newdf[0])

KeyError: 0

In [ ]:
type(newdf)

In [ ]:
newdf[0]  #accessing cols

# creating view

In [ ]:
df2=newdf  #points to old dataframe
           #changes made in new df will reflect in old newdf

In [ ]:
df2[0][0]=0.3291
newdf

In [ ]:
#making copy of df
df3=df2.copy()  #will make seprate copy of df
df3[0][0]=0.9922
df2

# Accessing val / changing fields using loc command

In [ ]:
df=pd.DataFrame(dict1)
df.columns=list("ABC")  #changing col indexing
df.head()

        A   B           C
0   omkar  23      rampur
1  sairaj  25      nagpur
2   rohan  25  jamshedpur

In [ ]:
#loc method
df.loc[0,0]="omkarsase"  #THIS WILL ADD COL WITH NAME 0 AS WE HAVE USED ABC INDEXING
df.head()

        A   B           C          0
0   omkar  23      rampur  omkarsase
1  sairaj  25      nagpur        NaN
2   rohan  25  jamshedpur        NaN

In [ ]:
df.loc[0,'A']="omkarsase"
df.head()

           A   B           C          0
0  omkarsase  23      rampur  omkarsase
1     sairaj  25      nagpur        NaN
2      rohan  25  jamshedpur        NaN

In [43]:
#creating view using loc command
df.loc[[1,2],['A','C','B']] #FOR SELECTED ROWS AND COLS
df.loc[:,['A','B']]         #FOR SELECTED COLS WITH ALL ROWS
df.loc[[0,2],:]

           A   B           C          0
0  omkarsase  23      rampur  omkarsase
2      rohan  25  jamshedpur        NaN

# conditional data using loc command

In [ ]:
newdf.loc[(newdf['b']>0.5) & (newdf['d']>0.6)]

# iloc for accessing data

In [49]:
print(df)
df.iloc[0:1,2:]  #[row,col]

           A   B           C          0
0  omkarsase  23      rampur  omkarsase
1     sairaj  25      nagpur        NaN
2      rohan  25  jamshedpur        NaN

        C          0
0  rampur  omkarsase

In [50]:
df.iloc[[1,2],[0,1]]  #creating view

        A   B
1  sairaj  25
2   rohan  25


# Dropping rows / cols

In [ ]:
df.drop(["first"])   #["row name"] one or multiple
# df.drop(0,axis=1)  #by def axix 0 (for row)
df.drop(['c','z*'],axis=1)  #for dropping cols 
#inplace=True will make changes in og df
# df.drop(['c','z*'],axis=1,inplace=True)  #for dropping cols

In [ ]:
#reset index after dropping col or rows
newdf
newdf.drop(['a','b'],axis=1,inplace=True)
newdf.drop([1,5],axis=0,inplace=True)
newdf.reset_index(drop=True,inplace=True)
newdf

# null values removing

In [ ]:
newdf.loc[:,['c']]=np.nan
newdf.loc[2,'c']=234
newdf['c'].isnull()
newdf

In [93]:
#dropping cols having all null values
newdf.loc[:,['c']]=np.nan   #for all rows with spcecific cols
newdf.loc[4:8,'d':'e']=234  #for specific region
newdf.loc[1,:]=np.nan
# newdf.dropna(axis=1)   #will remove all row having null value
# newdf.dropna(axis=0)   #will remove all row having null value
# newdf.loc[0,'c']=44
newdf

newdf.iloc[3,0]=np.nan
newdf
# newdf.dropna(how="all",axis=1) #will not drop col unless & until all col values become zero

                 a         b   c           d           e
0  [omkar, sairaj]  0.871735 NaN    0.093145    0.125359
1              NaN       NaN NaN         NaN         NaN
2              NaN  0.905553 NaN    0.415487    0.441121
3              NaN  0.793227 NaN    0.938383    0.201275
4         0.703251  0.429368 NaN  234.000000  234.000000
5         0.869188  0.256182 NaN  234.000000  234.000000
6         0.416681  0.176843 NaN  234.000000  234.000000
7         0.683456  0.722375 NaN  234.000000  234.000000
8         0.218887  0.175965 NaN  234.000000  234.000000
9         0.524484  0.985938 NaN    0.572005    0.092691

In [90]:
df1=pd.DataFrame(dict1)
# df1.loc[1,'marks']=np.nan
# df1.iloc[1:2,0:1]=np.nan
df1.iloc[0]=np.nan
df1
# df1.dropna(a)

     name  marks        city
0     NaN    NaN         NaN
1  sairaj   25.0      nagpur
2   rohan   25.0  jamshedpur

# Remove Duplicates

In [ ]:
newdf.iloc[0,0]="omkar"
newdf.iloc[1,0]="omkar"
# newdf.drop_duplicates(subset=['c'])
newdf.drop_duplicates(subset=['c'],keep='last')  #will delete all other records
newdf.drop_duplicates(subset=['c'],keep=False)  #will delete all records
# newdf

In [24]:
#shape
df.shape

(3, 3)

In [95]:
df.info()
df

<class 'pandas.core.frame.DataFrame'>
Index: 3 entries, first to third
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   c       3 non-null      object
 1   y       3 non-null      int64
 2   z*      3 non-null      object
dtypes: int64(1), object(2)
memory usage: 96.0+ bytes

             c   y          z*
first    omkar  23      rampur
second  sairaj  25      nagpur
third    rohan  25  jamshedpur

In [98]:
df['c'].value_counts()
df['c'].value_counts(dropna=True)  #dill not give cnt for val with nan val

omkar     1
sairaj    1
rohan     1
Name: c, dtype: int64

In [99]:
#null val non-null value
df.isnull()

            c      y     z*
first   False  False  False
second  False  False  False
third   False  False  False

# read excel

In [100]:
data=df.read_excel('data.xlsx')   #pip install xlrd for sheet 1
data=df.read_excel('data.xlsx',sheet_name='<sheetname>')

AttributeError: 'DataFrame' object has no attribute 'read_excel'

In [ ]:
#export to excel
data.to_excel('data.xlsx') #pip install openpyxl